map = {
	长安城 = {
		江南野外 = {mp = Point( 1090,  579),gp = Point(1167,613)};
		化生寺 = {mp = Point( 1035,  127)};
		大唐官府 = {mp = Point(  700,  127),gp = Point(529,12)};
		大唐国境 = {mp = Point(189,  584),gp= Point( 118,  605)};
		镖局 = {mp =Point( 1062,  339),gp=Point( 947,  211)};
	},
	长风镖局 = {
		郑镖头 = {dP =Point( 766,  209),npc=t.npc郑镖头};
	},
	
	江南野外 = {
		长安城 = {};
		建邺城 = {mp= Point( 1002,  407),npc=t.npc郑镖头};
	},
	大唐官府 = {
		程咬金府 = {mp =Point( 599,  362),gp=Point(510,  251)};
	},
	建邺城 = {
		东海湾 = {mp =Point(1050,  514),}
	},
	大唐境外 = {
		长寿郊亭 = {mp = Point( 185,  434),npc = t.长郊亭土地};
	},
	灵台宫 = {
		菩提祖师 = {dP =Point(916,  167),npc=t.npc菩提祖师};
	}
};

line ={
	东海龙王 = {
		{t.长安城,map.长安城.大唐国境};
	--	{t.大唐境外,map.江南野外.建邺城};
		{t.大唐境外,map.大唐境外.长寿郊亭};
		{t.灵台宫,map.灵台宫.菩提祖师};
	},
	程咬金 ={
		
	}

};

